<template>
    <div class="items">
        <movie-item v-for="movie in movies" :movie-detail="movie" class="item"></movie-item>
    </div>
    <page-selector @vnode-updated="updatePage()" v-model="currentPage"></page-selector>

</template>

<script lang="ts" setup>
import MovieItem from "./MovieItem/MovieItem.vue";
import PageSelector from '../PageSelector.vue';
import { ref } from "vue";
import { useStore } from "vuex";

const store = useStore()

// 标题设置
store.commit('setTitle', '电影数据库')

const currentPage = ref(1);

const movies = ref([
    {
        id: 1291543,
        img:'https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2219011938.webp',
        name:'功夫',
        year: 2004,
        tags: ["周星驰", "喜剧", "香港", "功夫", "动作", "香港电影", "搞笑", "经典"],
        desc:'1940年代的上海，自小受尽欺辱的街头混混阿星（周星驰）为了能出人头地，可谓窥见机会的缝隙就往里钻，今次他盯上行动日益猖獗的黑道势力“斧头帮”，想借之大名成就大业。阿星假冒“斧头帮”成员试图在一个叫“猪笼城寨”的地方对居民敲诈，不想引来真的“斧头帮”与“猪笼城寨”居民的恩怨。“猪笼城寨”原是藏龙卧虎之处，居民中有许多身怀绝技者（元华、梁小龙等），他们隐藏于此本是为远离江湖恩怨，不想麻烦自动上身，躲都躲不及。而在观战正邪两派的斗争中，阿星逐渐领悟功夫的真谛。'
    },
    {
        id: 1291543,
        img:'https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2219011938.webp',
        name:'功夫',
        year: 2004,
        tags: ["周星驰", "喜剧", "香港", "功夫", "动作", "香港电影", "搞笑", "经典"],
        desc:'1940年代的上海，自小受尽欺辱的街头混混阿星（周星驰）为了能出人头地，可谓窥见机会的缝隙就往里钻，今次他盯上行动日益猖獗的黑道势力“斧头帮”，想借之大名成就大业。阿星假冒“斧头帮”成员试图在一个叫“猪笼城寨”的地方对居民敲诈，不想引来真的“斧头帮”与“猪笼城寨”居民的恩怨。“猪笼城寨”原是藏龙卧虎之处，居民中有许多身怀绝技者（元华、梁小龙等），他们隐藏于此本是为远离江湖恩怨，不想麻烦自动上身，躲都躲不及。而在观战正邪两派的斗争中，阿星逐渐领悟功夫的真谛。'
    },
    {
        id: 1291543,
        img:'https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2219011938.webp',
        name:'功夫',
        year: 2004,
        tags: ["周星驰", "喜剧", "香港", "功夫", "动作", "香港电影", "搞笑", "经典"],
        desc:'1940年代的上海，自小受尽欺辱的街头混混阿星（周星驰）为了能出人头地，可谓窥见机会的缝隙就往里钻，今次他盯上行动日益猖獗的黑道势力“斧头帮”，想借之大名成就大业。阿星假冒“斧头帮”成员试图在一个叫“猪笼城寨”的地方对居民敲诈，不想引来真的“斧头帮”与“猪笼城寨”居民的恩怨。“猪笼城寨”原是藏龙卧虎之处，居民中有许多身怀绝技者（元华、梁小龙等），他们隐藏于此本是为远离江湖恩怨，不想麻烦自动上身，躲都躲不及。而在观战正邪两派的斗争中，阿星逐渐领悟功夫的真谛。'
    },
    {
        id: 1291543,
        img:'https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2219011938.webp',
        name:'功夫',
        year: 2004,
        tags: ["周星驰", "喜剧", "香港", "功夫", "动作", "香港电影", "搞笑", "经典"],
        desc:'1940年代的上海，自小受尽欺辱的街头混混阿星（周星驰）为了能出人头地，可谓窥见机会的缝隙就往里钻，今次他盯上行动日益猖獗的黑道势力“斧头帮”，想借之大名成就大业。阿星假冒“斧头帮”成员试图在一个叫“猪笼城寨”的地方对居民敲诈，不想引来真的“斧头帮”与“猪笼城寨”居民的恩怨。“猪笼城寨”原是藏龙卧虎之处，居民中有许多身怀绝技者（元华、梁小龙等），他们隐藏于此本是为远离江湖恩怨，不想麻烦自动上身，躲都躲不及。而在观战正邪两派的斗争中，阿星逐渐领悟功夫的真谛。'
    },
    {
        id: 1291543,
        img:'https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2219011938.webp',
        name:'功夫',
        year: 2004,
        tags: ["周星驰", "喜剧", "香港", "功夫", "动作", "香港电影", "搞笑", "经典"],
        desc:'1940年代的上海，自小受尽欺辱的街头混混阿星（周星驰）为了能出人头地，可谓窥见机会的缝隙就往里钻，今次他盯上行动日益猖獗的黑道势力“斧头帮”，想借之大名成就大业。阿星假冒“斧头帮”成员试图在一个叫“猪笼城寨”的地方对居民敲诈，不想引来真的“斧头帮”与“猪笼城寨”居民的恩怨。“猪笼城寨”原是藏龙卧虎之处，居民中有许多身怀绝技者（元华、梁小龙等），他们隐藏于此本是为远离江湖恩怨，不想麻烦自动上身，躲都躲不及。而在观战正邪两派的斗争中，阿星逐渐领悟功夫的真谛。'
    },
    {
        id: 1291543,
        img:'https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2219011938.webp',
        name:'功夫',
        year: 2004,
        tags: ["周星驰", "喜剧", "香港", "功夫", "动作", "香港电影", "搞笑", "经典"],
        desc:'1940年代的上海，自小受尽欺辱的街头混混阿星（周星驰）为了能出人头地，可谓窥见机会的缝隙就往里钻，今次他盯上行动日益猖獗的黑道势力“斧头帮”，想借之大名成就大业。阿星假冒“斧头帮”成员试图在一个叫“猪笼城寨”的地方对居民敲诈，不想引来真的“斧头帮”与“猪笼城寨”居民的恩怨。“猪笼城寨”原是藏龙卧虎之处，居民中有许多身怀绝技者（元华、梁小龙等），他们隐藏于此本是为远离江湖恩怨，不想麻烦自动上身，躲都躲不及。而在观战正邪两派的斗争中，阿星逐渐领悟功夫的真谛。'
    }
])

const updatePage = () => {
    // 重新加载MovieItem的数据
    // 其他筛选参数从vuex中获取
    console.log(`页码更新了，现在应该用ajax请求电影的第${currentPage.value}页`)

}

</script>
<style scoped>
.items {
    max-height: 68vh;
    display: flex;
    flex-wrap: wrap;
    justify-content: flex-start;
}
</style>